garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1579.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM2OFH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM2OFH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDA8">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="OF" edc:desc="" edc:mask="0xff" edc:name="OF" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM2OFH0" edc:desc="" edc:mask="0x1" edc:name="PWM2OFH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2OFH1" edc:desc="" edc:mask="0x1" edc:name="PWM2OFH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2OFH2" edc:desc="" edc:mask="0x1" edc:name="PWM2OFH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2OFH3" edc:desc="" edc:mask="0x1" edc:name="PWM2OFH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2OFH4" edc:desc="" edc:mask="0x1" edc:name="PWM2OFH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2OFH5" edc:desc="" edc:mask="0x1" edc:name="PWM2OFH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2OFH6" edc:desc="" edc:mask="0x1" edc:name="PWM2OFH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2OFH7" edc:desc="" edc:mask="0x1" edc:name="PWM2OFH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM2OFH" edc:desc="" edc:mask="0xff" edc:name="PWM2OFH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PWM2TMR" edc:desc="" edc:name="PWM2TMR" edc:nzwidth="0x10" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDA9">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM2TMRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM2TMRL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDA9">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TMR" edc:desc="" edc:mask="0xff" edc:name="TMR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM2TMRL0" edc:desc="" edc:mask="0x1" edc:name="PWM2TMRL0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2TMRL1" edc:desc="" edc:mask="0x1" edc:name="PWM2TMRL1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2TMRL2" edc:desc="" edc:mask="0x1" edc:name="PWM2TMRL2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2TMRL3" edc:desc="" edc:mask="0x1" edc:name="PWM2TMRL3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2TMRL4" edc:desc="" edc:mask="0x1" edc:name="PWM2TMRL4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2TMRL5" edc:desc="" edc:mask="0x1" edc:name="PWM2TMRL5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2TMRL6" edc:desc="" edc:mask="0x1" edc:name="PWM2TMRL6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2TMRL7" edc:desc="" edc:mask="0x1" edc:name="PWM2TMRL7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM2TMRL" edc:desc="" edc:mask="0xff" edc:name="PWM2TMRL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM2TMRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM2TMRH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDAA">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TMR" edc:desc="" edc:mask="0xff" edc:name="TMR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM2TMRH0" edc:desc="" edc:mask="0x1" edc:name="PWM2TMRH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2TMRH1" edc:desc="" edc:mask="0x1" edc:name="PWM2TMRH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2TMRH2" edc:desc="" edc:mask="0x1" edc:name="PWM2TMRH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2TMRH3" edc:desc="" edc:mask="0x1" edc:name="PWM2TMRH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2TMRH4" edc:desc="" edc:mask="0x1" edc:name="PWM2TMRH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2TMRH5" edc:desc="" edc:mask="0x1" edc:name="PWM2TMRH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2TMRH6" edc:desc="" edc:mask="0x1" edc:name="PWM2TMRH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM2TMRH7" edc:desc="" edc:mask="0x1" edc:name="PWM2TMRH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM2TMRH" edc:desc="" edc:mask="0xff" edc:name="PWM2TMRH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnrnnn--" edc:cname="PWM2CON" edc:desc="" edc:impl="0xfc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000--" edc:name="PWM2CON" edc:nzwidth="8" edc:por="000000--" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDAB">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x3" edc:name="MODE" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OE" edc:desc="" edc:mask="0x1" edc:name="OE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM2MODE0" edc:desc="" edc:mask="0x1" edc:name="PWM2MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2MODE1" edc:desc="" edc:mask="0x1" edc:name="PWM2MODE1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="PWM2MODE" edc:desc="" edc:mask="0x3" edc:name="PWM2MODE" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="PWM2POL" edc:desc="" edc:mask="0x1" edc:name="PWM2POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2OUT" edc:desc="" edc:mask="0x1" edc:name="PWM2OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2OE" edc:desc="" edc:mask="0x1" edc:name="PWM2OE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2EN" edc:desc="" edc:mask="0x1" edc:name="PWM2EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="PWM2INTE" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PWM2INTE" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDAC">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="PWM2INTCON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRIE" edc:desc="" edc:mask="0x1" edc:name="PRIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DCIE" edc:desc="" edc:mask="0x1" edc:name="DCIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHIE" edc:desc="" edc:mask="0x1" edc:name="PHIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OFIE" edc:desc="" edc:mask="0x1" edc:name="OFIE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM2PRIE" edc:desc="" edc:mask="0x1" edc:name="PWM2PRIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2DCIE" edc:desc="" edc:mask="0x1" edc:name="PWM2DCIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2PHIE" edc:desc="" edc:mask="0x1" edc:name="PWM2PHIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2OFIE" edc:desc="" edc:mask="0x1" edc:name="PWM2OFIE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----cccc" edc:cname="PWM2INTF" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PWM2INTF" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDAD">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="PWM2INTFLG"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRIF" edc:desc="" edc:mask="0x1" edc:name="PRIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DCIF" edc:desc="" edc:mask="0x1" edc:name="DCIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHIF" edc:desc="" edc:mask="0x1" edc:name="PHIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OFIF" edc:desc="" edc:mask="0x1" edc:name="OFIF" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM2PRIF" edc:desc="" edc:mask="0x1" edc:name="PWM2PRIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2DCIF" edc:desc="" edc:mask="0x1" edc:name="PWM2DCIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2PHIF" edc:desc="" edc:mask="0x1" edc:name="PWM2PHIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2OFIF" edc:desc="" edc:mask="0x1" edc:name="PWM2OFIF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnn--nn" edc:cname="PWM2CLKCON" edc:desc="" edc:impl="0x73" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000--00" edc:name="PWM2CLKCON" edc:nzwidth="8" edc:por="-000--00" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDAE">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CS" edc:desc="" edc:mask="0x3" edc:name="CS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PS" edc:desc="" edc:mask="0x7" edc:name="PS" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM2CS0" edc:desc="" edc:mask="0x1" edc:name="PWM2CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2CS1" edc:desc="" edc:mask="0x1" edc:name="PWM2CS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM2PS0" edc:desc="" edc:mask="0x1" edc:name="PWM2PS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2PS1" edc:desc="" edc:mask="0x1" edc:name="PWM2PS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2PS2" edc:desc="" edc:mask="0x1" edc:name="PWM2PS2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PWM2CS" edc:desc="" edc:mask="0x3" edc:name="PWM2CS" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM2PS" edc:desc="" edc:mask="0x7" edc:name="PWM2PS" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CS0" edc:desc="" edc:mask="0x1" edc:name="CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CS1" edc:desc="" edc:mask="0x1" edc:name="CS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PS0" edc:desc="" edc:mask="0x1" edc:name="PS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PS1" edc:desc="" edc:mask="0x1" edc:name="PS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PS2" edc:desc="" edc:mask="0x1" edc:name="PS2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn----nn" edc:cname="PWM2LDCON" edc:desc="" edc:impl="0xc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00----00" edc:name="PWM2LDCON" edc:nzwidth="8" edc:por="00----00" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDAF">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LDS" edc:desc="" edc:mask="0x3" edc:name="LDS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="LDT" edc:desc="" edc:mask="0x1" edc:name="LDT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LDA" edc:desc="" edc:mask="0x1" edc:name="LDA" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM2LDS0" edc:desc="" edc:mask="0x1" edc:name="PWM2LDS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2LDS1" edc:desc="" edc:mask="0x1" edc:name="PWM2LDS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PWM2LDS" edc:desc="" edc:mask="0x3" edc:name="PWM2LDS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="PWM2LDM" edc:desc="" edc:mask="0x1" edc:name="PWM2LDM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2LD" edc:desc="" edc:mask="0x1" edc:name="PWM2LD" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="LDS0" edc:desc="" edc:mask="0x1" edc:name="LDS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LDS1" edc:desc="" edc:mask="0x1" edc:name="LDS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnn--nn" edc:cname="PWM2OFCON" edc:desc="" edc:impl="0x73" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000--00" edc:name="PWM2OFCON" edc:nzwidth="8" edc:por="-000--00" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDB0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OFS" edc:desc="" edc:mask="0x3" edc:name="OFS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OFO" edc:desc="" edc:mask="0x1" edc:name="OFO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OFM" edc:desc="" edc:mask="0x3" edc:name="OFM" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM2OFS0" edc:desc="" edc:mask="0x1" edc:name="PWM2OFS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2OFS1" edc:desc="" edc:mask="0x1" edc:name="PWM2OFS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="PWM2OFM0" edc:desc="" edc:mask="0x1" edc:name="PWM2OFM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2OFM1" edc:desc="" edc:mask="0x1" edc:name="PWM2OFM1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PWM2OFS" edc:desc="" edc:mask="0x3" edc:name="PWM2OFS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="PWM2OFMC" edc:desc="" edc:mask="0x1" edc:name="PWM2OFMC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2OFM" edc:desc="" edc:mask="0x3" edc:name="PWM2OFM" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OFS0" edc:desc="" edc:mask="0x1" edc:name="OFS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OFS1" edc:desc="" edc:mask="0x1" edc:name="OFS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="OFM0" edc:desc="" edc:mask="0x1" edc:name="OFM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OFM1" edc:desc="" edc:mask="0x1" edc:name="OFM1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="PWM3PH" edc:desc="" edc:name="PWM3PH" edc:nzwidth="0x10" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDB1">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM3PHL" edc:desc="8-bit period timer" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM3PHL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDB1">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PH" edc:desc="" edc:mask="0xff" edc:name="PH" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM3PHL0" edc:desc="" edc:mask="0x1" edc:name="PWM3PHL0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3PHL1" edc:desc="" edc:mask="0x1" edc:name="PWM3PHL1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3PHL2" edc:desc="" edc:mask="0x1" edc:name="PWM3PHL2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3PHL3" edc:desc="" edc:mask="0x1" edc:name="PWM3PHL3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3PHL4" edc:desc="" edc:mask="0x1" edc:name="PWM3PHL4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3PHL5" edc:desc="" edc:mask="0x1" edc:name="PWM3PHL5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3PHL6" edc:desc="" edc:mask="0x1" edc:name="PWM3PHL6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3PHL7" edc:desc="" edc:mask="0x1" edc:name="PWM3PHL7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM3PHL" edc:desc="" edc:mask="0xff" edc:name="PWM3PHL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM3PHH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM3PHH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDB2">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PH" edc:desc="" edc:mask="0xff" edc:name="PH" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM3PHH0" edc:desc="" edc:mask="0x1" edc:name="PWM3PHH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3PHH1" edc:desc="" edc:mask="0x1" edc:name="PWM3PHH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3PHH2" edc:desc="" edc:mask="0x1" edc:name="PWM3PHH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3PHH3" edc:desc="" edc:mask="0x1" edc:name="PWM3PHH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3PHH4" edc:desc="" edc:mask="0x1" edc:name="PWM3PHH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3PHH5" edc:desc="" edc:mask="0x1" edc:name="PWM3PHH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3PHH6" edc:desc="" edc:mask="0x1" edc:name="PWM3PHH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3PHH7" edc:desc="" edc:mask="0x1" edc:name="PWM3PHH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM3PHH" edc:desc="" edc:mask="0xff" edc:name="PWM3PHH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
