garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1579.PIC
        <edc:SFRDef edc:access="----nnnn" edc:cname="RB5PPS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuu" edc:name="RB5PPS" edc:nzwidth="8" edc:por="----0000" edc:_addr="0xE9D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RB5PPS" edc:desc="" edc:mask="0xf" edc:name="RB5PPS" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RB5PPS0" edc:desc="" edc:mask="0x1" edc:name="RB5PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB5PPS1" edc:desc="" edc:mask="0x1" edc:name="RB5PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB5PPS2" edc:desc="" edc:mask="0x1" edc:name="RB5PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB5PPS3" edc:desc="" edc:mask="0x1" edc:name="RB5PPS3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="RB6PPS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuu" edc:name="RB6PPS" edc:nzwidth="8" edc:por="----0000" edc:_addr="0xE9E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RB6PPS" edc:desc="" edc:mask="0xf" edc:name="RB6PPS" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RB6PPS0" edc:desc="" edc:mask="0x1" edc:name="RB6PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB6PPS1" edc:desc="" edc:mask="0x1" edc:name="RB6PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB6PPS2" edc:desc="" edc:mask="0x1" edc:name="RB6PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB6PPS3" edc:desc="" edc:mask="0x1" edc:name="RB6PPS3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="RB7PPS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuu" edc:name="RB7PPS" edc:nzwidth="8" edc:por="----0000" edc:_addr="0xE9F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RB7PPS" edc:desc="" edc:mask="0xf" edc:name="RB7PPS" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RB7PPS0" edc:desc="" edc:mask="0x1" edc:name="RB7PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB7PPS1" edc:desc="" edc:mask="0x1" edc:name="RB7PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB7PPS2" edc:desc="" edc:mask="0x1" edc:name="RB7PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB7PPS3" edc:desc="" edc:mask="0x1" edc:name="RB7PPS3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="RC0PPS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuu" edc:name="RC0PPS" edc:nzwidth="8" edc:por="----0000" edc:_addr="0xEA0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC0PPS" edc:desc="" edc:mask="0xf" edc:name="RC0PPS" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RC0PPS0" edc:desc="" edc:mask="0x1" edc:name="RC0PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RC0PPS1" edc:desc="" edc:mask="0x1" edc:name="RC0PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RC0PPS2" edc:desc="" edc:mask="0x1" edc:name="RC0PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RC0PPS3" edc:desc="" edc:mask="0x1" edc:name="RC0PPS3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="RC1PPS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuu" edc:name="RC1PPS" edc:nzwidth="8" edc:por="----0000" edc:_addr="0xEA1">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC1PPS" edc:desc="" edc:mask="0xf" edc:name="RC1PPS" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RC1PPS0" edc:desc="" edc:mask="0x1" edc:name="RC1PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RC1PPS1" edc:desc="" edc:mask="0x1" edc:name="RC1PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RC1PPS2" edc:desc="" edc:mask="0x1" edc:name="RC1PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RC1PPS3" edc:desc="" edc:mask="0x1" edc:name="RC1PPS3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="RC2PPS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuu" edc:name="RC2PPS" edc:nzwidth="8" edc:por="----0000" edc:_addr="0xEA2">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC2PPS" edc:desc="" edc:mask="0xf" edc:name="RC2PPS" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RC2PPS0" edc:desc="" edc:mask="0x1" edc:name="RC2PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RC2PPS1" edc:desc="" edc:mask="0x1" edc:name="RC2PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RC2PPS2" edc:desc="" edc:mask="0x1" edc:name="RC2PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RC2PPS3" edc:desc="" edc:mask="0x1" edc:name="RC2PPS3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
